[
  {
    "id": 1,
    "orgName": "Citi (Citigroup)",
    "jobTitle": "Software Engineer Intern",
    "startDate": "2025-05-05T00:00:00.000Z",
    "endDate": "2025-08-22T00:00:00.000Z",
    "description": "Used OpenTelemetry and Grafana's LGTM stack (Loki, Grafana, Tempo, Mimir) to instrument over 20 microservices with OpenTelemetry, resulting in better observability. Refactored existing regression tests to increase coverage to 80% and reduce execution times by 50%."
  },
  {
    "id": 2,
    "orgName": "DrawDream",
    "jobTitle": "Full Stack Engineer Intern",
    "startDate": "2025-02-19T00:00:00.000Z",
    "endDate": "2025-04-02T00:00:00.000Z",
    "description": "Built responsive web applications using MERN stack, designed and implemented RESTful APIs, and collaborated with cross-functional teams to deliver product features like session booking, cancelling, authentication."
  },
  {
    "id": 1,
    "orgName": "Citi (Citigroup)",
    "jobTitle": "Software Engineer Intern",
    "startDate": "2024-05-06T00:00:00.000Z",
    "endDate": "2025-08-23T00:00:00.000Z",
    "description": "Led migration efforts of over 170 packages to new CI/CD pipelines. Automated provisioning of infrastructure using Ansible's support for IaC. Optimized CI/CD pipelines by using build stage cacheing, reducing Java service deployments by 1.5 minutes and KDB/python package deployments by 4 minutes on average."
  },
  {
    "id": 4,
    "orgName": "Quadratic Sound",
    "jobTitle": "Full Stack Engineer Intern",
    "startDate": "2024-02-28T00:00:00.000Z",
    "endDate": "2024-05-03T00:00:00.000Z",
    "description": "Developed and refactored an event management system using SvelteKit, separating business logic from presentation for cleaner architecture and maintainability. Implemented REST APIs with SvelteKit API routes, automated test data seeding with TypeScript/JavaScript, and used Postman for testing—streamlining local builds and reducing reliance on remote environments."
  },
  {
    "id": 5,
    "orgName": "ImmiCan",
    "jobTitle": "Backend Engineering Intern",
    "startDate": "2024-02-28T00:00:00.000Z",
    "endDate": "2024-05-04T00:00:00.000Z",
    "description": "Chatbot development using Llama2, LangChain, ChromaDB, Flask. Designed and implemented a RAG pipeline to enhance conversations using our custom knowledge base."
  }, 
  {
    "id": 6,
    "orgName": "Citi (Citigroup)",
    "jobTitle": "Software Engineer Intern",
    "startDate": "2023-05-02T00:00:00.000Z",
    "endDate": "2023-08-18T00:00:00.000Z",
    "description": "Implemented a health checker microservice that monitored downstream services (Amazon S3, MongoDB clusters, Kafka instances, etc) using a combination of cloud APIs and actuator endpoints. Implemented automated alerts for better monitoring."
  },
  {
    "id": 7,
    "orgName": "Inwit",
    "jobTitle": "Full Stack Developer Intern",
    "startDate": "2022-02-09T00:00:00.000Z",
    "endDate": "2022-04-11T00:00:00.000Z",
    "description": "Web and app development using React, PHP. Refactored and separated code into components for better reusability. Implemented pages using React's core features like hooks, state management, etc."
  }

]